Enterprise_Serivces/Prod/Bronze4/ReservationService/result1/Iteration1/t3_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><CorrelationID xmlns="http://services.gamestop.com/sales/reservation/reservationservice/v1.0">b987500b-f7e7-4050-8f62-8aad26f519f8</CorrelationID><MachineName xmlns="http://services.gamestop.com/sales/reservation/reservationservice/v1.0">test</MachineName><wsa:Action>http://services.gamestop.com/sales/reservation/reservationservice/v1.0/IReservationService/GetReservationsByOrderNumber</wsa:Action><wsa:MessageID>uuid:574ca536-41ea-413f-af52-016358234ef2</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslreservationserviceqa1.testgs.pvt/ReservationService.svc</wsa:To></soap:Header><soap:Body><GetReservationRequest xmlns="http://services.gamestop.com/sales/reservation/reservationservice/v1.0"><OrderReferenceNumber>33693832410462</OrderReferenceNumber></GetReservationRequest></soap:Body></soap:Envelope>